src/DataProcessors/ПланированиеОтпусков/ПланированиеОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПланированиеОтпусков</name>
</mdclass:DataProcessor>

src/InformationRegisters/ПлановоеОтсутствие/ПлановоеОтсутствие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановоеОтсутствие</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ПланированиеОтпусков/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеОтсутствие.Сотрудник,
		|	ПлановоеОтсутствие.ДатаНачала,
		|	ПлановоеОтсутствие.ДатаОкончания,
		|	ПРЕДСТАВЛЕНИЕ(ПлановоеОтсутствие.Сотрудник) КАК СотрудникПредставление,
		|	ПлановоеОтсутствие.Регистратор
		|ИЗ
		|	РегистрСведений.ПлановоеОтсутствие КАК ПлановоеОтсутствие
		|ГДЕ
		|	ПлановоеОтсутствие.ДатаНачала < &КонецПериода
		|	И ПлановоеОтсутствие.ДатаОкончания > &НачалоПериода";
		
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДиаграммаГанта.Очистить();
	
	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Значение = "Отсутствие";
	Серия.Текст = "Отсутствия";
	
	ТочкиСотрудников = Новый Соответствие();
		
	Пока Выборка.Следующий() Цикл
		
		Точка = ТочкиСотрудников.Получить(Выборка.Сотрудник);
		
		Если Точка = Неопределено Тогда
			
			Точка = ДиаграммаГанта.Точки.Добавить();
			Точка.Значение = Выборка.Сотрудник;
			Точка.Текст = Выборка.СотрудникПредставление;
			ТочкиСотрудников.Вставить(Выборка.Сотрудник, Точка);
			
		КонецЕсли;
				
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Выборка.ДатаНачала;
		Интервал.Конец = Выборка.ДатаОкончания;
		Интервал.Расшифровка = Выборка.Регистратор;
		
	КонецЦикла;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
КонецПроцедуры
#КонецОбласти
